In [1]:
import pandas as pd
import warnings
warnings.filterwarnings("ignore")

In [2]:
import os

In [3]:
import seaborn as sns
sns.set_style(style="darkgrid")

In [4]:
current=os.getcwd()

In [5]:
root=os.path.dirname(current)

In [6]:
print(root)

C:\Users\t470p\Documents\GitHub\channels\New folder\Claxon-DataScience-hackathon

In [7]:
os.listdir(root)

['.git', '.gitattributes', 'data', 'LICENSE', 'notebooks', 'source documents']

In [8]:
path=os.path.join(root,'data','data_science_competition_2024.csv')

In [9]:
df=pd.read_csv(path)

In [10]:
df.head()

,Unnamed: 0,loan_id,gender,disbursemet_date,currency,country,sex,is_employed,job,location,...,number_of_defaults,outstanding_balance,interest_rate,age,number_of_defaults.1,remaining term,salary,marital_status,age.1,Loan Status
0,0,8d05de78-ff32-46b1-aeb5-b3190f9c158a,female,2022 10 29,USD,Zimbabwe,female,True,Teacher,Beitbridge,...,0,48653.011473,0.22,37,0,47,3230.038869,married,37,Did not default
1,1,368bf756-fcf2-4822-9612-f445d90b485b,other,2020 06 06,USD,Zimbabwe,other,True,Teacher,Harare,...,2,28752.062237,0.20,43,2,62,3194.139103,single,43,Did not default
2,2,6e3be39e-49b5-45b5-aab6-c6556de53c6f,other,2023 09 29,USD,Zimbabwe,other,True,Nurse,Gweru,...,1,44797.554126,0.22,43,1,57,3330.826656,married,43,Did not default
3,3,191c62f8-2211-49fe-ba91-43556b307871,female,2022 06 22,USD,Zimbabwe,female,True,Doctor,Rusape,...,0,35681.496413,0.23,47,0,42,2246.797020,divorced,47,Did not default
4,4,477cd8a1-3b01-4623-9318-8cd6122a8346,male,2023 02 08,USD,Zimbabwe,male,True,Nurse,Chipinge,...,0,34156.055882,0.20,42,0,45,2310.858441,married,42,Did not default

In [11]:
df=pd.read_csv(path,index_col=0)

In [12]:
df.head()

,loan_id,gender,disbursemet_date,currency,country,sex,is_employed,job,location,loan_amount,number_of_defaults,outstanding_balance,interest_rate,age,number_of_defaults.1,remaining term,salary,marital_status,age.1,Loan Status
0,8d05de78-ff32-46b1-aeb5-b3190f9c158a,female,2022 10 29,USD,Zimbabwe,female,True,Teacher,Beitbridge,39000.0,0,48653.011473,0.22,37,0,47,3230.038869,married,37,Did not default
1,368bf756-fcf2-4822-9612-f445d90b485b,other,2020 06 06,USD,Zimbabwe,other,True,Teacher,Harare,27000.0,2,28752.062237,0.20,43,2,62,3194.139103,single,43,Did not default
2,6e3be39e-49b5-45b5-aab6-c6556de53c6f,other,2023 09 29,USD,Zimbabwe,other,True,Nurse,Gweru,35000.0,1,44797.554126,0.22,43,1,57,3330.826656,married,43,Did not default
3,191c62f8-2211-49fe-ba91-43556b307871,female,2022 06 22,USD,Zimbabwe,female,True,Doctor,Rusape,24000.0,0,35681.496413,0.23,47,0,42,2246.797020,divorced,47,Did not default
4,477cd8a1-3b01-4623-9318-8cd6122a8346,male,2023 02 08,USD,Zimbabwe,male,True,Nurse,Chipinge,19000.0,0,34156.055882,0.20,42,0,45,2310.858441,married,42,Did not default

---

### checking for number of rows and columns

In [13]:
rows,columns=df.shape

In [14]:
print("rows:{}\ncolumns:{}".format(rows,columns))

rows:100000
columns:20

### checking for missing values

In [15]:
df.isnull().sum()

loan_id                    0
gender                     0
disbursemet_date           0
currency                   0
country                  100
sex                        0
is_employed                0
job                     4136
location                 595
loan_amount                0
number_of_defaults         0
outstanding_balance        0
interest_rate              0
age                        0
number_of_defaults.1       0
remaining term             0
salary                     0
marital_status             0
age.1                      0
Loan Status                0
dtype: int64

### further inspecting null columns

In [16]:
nulls=df.isnull().sum()

In [17]:
nulls=nulls[nulls>0]

In [18]:
nulls

country      100
job         4136
location     595
dtype: int64

In [19]:
hasattr(nulls,'name')

True

In [20]:
nulls.name

In [21]:
null_columns=nulls.index.tolist()

In [22]:
null_columns

['country', 'job', 'location']

In [23]:
subset=df[null_columns]

In [24]:
subset.head()

    country      job    location
0  Zimbabwe  Teacher  Beitbridge
1  Zimbabwe  Teacher      Harare
2  Zimbabwe    Nurse       Gweru
3  Zimbabwe   Doctor      Rusape
4  Zimbabwe    Nurse    Chipinge

In [25]:
subset.country.nunique()

3

In [26]:
subset.country.value_counts()

Zimbabwe    99787
zimbabwe      100
Zim            13
Name: country, dtype: int64

### making the country codes uniform

In [27]:
subset['country']=subset.country.str.title()

In [28]:
subset.country.value_counts()

Zimbabwe    99887
Zim            13
Name: country, dtype: int64

In [29]:
subset['country']=subset.country.apply(lambda x:'Zimbabwe' if x=='Zim' else x)

In [30]:
subset.country.value_counts()

Zimbabwe    99900
Name: country, dtype: int64

In [31]:
subset['country']=subset.country.fillna('Zimbabwe')

In [32]:
df['country']=subset.country

In [33]:
subset=subset.drop('country',axis=1)

In [34]:
subset.head()

       job    location
0  Teacher  Beitbridge
1  Teacher      Harare
2    Nurse       Gweru
3   Doctor      Rusape
4    Nurse    Chipinge

In [35]:
subset.describe().transpose()

          count unique       top   freq
job       95864     11  Engineer  16524
location  99405    157    Harare   8338

### filling missing values with most frequent values

In [36]:
most_frequent=subset.describe().transpose().top
most_frequent

job         Engineer
location      Harare
Name: top, dtype: object

In [37]:
df['job']=most_frequent.job
df['location']=most_frequent.location

### now checking null values

In [38]:
df.isnull().sum()

loan_id                 0
gender                  0
disbursemet_date        0
currency                0
country                 0
sex                     0
is_employed             0
job                     0
location                0
loan_amount             0
number_of_defaults      0
outstanding_balance     0
interest_rate           0
age                     0
number_of_defaults.1    0
remaining term          0
salary                  0
marital_status          0
age.1                   0
Loan Status             0
dtype: int64

---